<!-- dflook/terraform-github-actions {"workspace":"default","backend":"58e20da37c5c39fb53a8ba9c7d37810c10622b4f865432bdd588b9eef389d2ed","backend_type":"s3","plan_job_ref":"Job terraform-plan-05-aws-complete #24 at https://github.com/pipetail/terraform/actions/runs/3552793563","plan_hash":"f511cd87c7a31284a248f4dea4c9d83d9464e3b38ad82b7a71505afe1bcc60c5","plan_text_format":"text"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::175912345102:role/complete-example-prod20221126013439398900000014"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::175912345102:role/github_actions_terraform"
                  "username": "infrastructure:{{SessionName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::175912345102:role/eks_administrator"
                  "username": "administrator:{{SessionName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://553C5653031446FC2818A97F1635B21F.gr7.eu-west-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1URXlOakF4TXpBd00xb1hEVE15TVRFeU16QXhNekF3TTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBSmJhClIyNStDZWNYK2Eza3Ixb05yS2hlNDNmWGNNOG93cVM4OW02WERXb3VFSGlMWXZSQitaQU1RaXpHYUlhWXFKT2IKMXMxZGtKdE1rZ0tRckVKZkVpeGNTdExmM2lDSjRGMWdSdnBKeEE4SXd4QThVWGo5bktWOTlEemZ4YzU4akhNMgpHSXl5RnZvSzlBM1dYc2V3UVRCV1lUeW4wc3FCK25QaUxzczc1bHB6dUlhSDlUZUxFYkF5TUNHUFRRNDFJclZNCmh2ZUxGVDZGME02c1N5RG5YWGFnT1F1b0UvNnJUdVMzMDd0bTA3NmFYUXZoUEZ6T1N5aDVZK1oyUGh4L3AyWnkKd3VjNkYyc3d0WURkcktQMUorWGJyckhhV20xYnUraWM1QlNnT1EranRMUkQ4bUt5bHdvdU5HdDU4ektHdEtYVgpYdm9wL0VHZVJkdThVbnhZVS9FQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZJNmNlOUR3MTNFd2xQQWpIUkRRS1VtZnBmQUxNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBRFV1NUlMWXNybCs2WkMzUzBvKwp1Ukp6UElpcXYyb0NGM2NIZENBZ2dyQi91d3A1bmNLQzkxeHUvb3ZkQVJ6ckozY1Z6TEJvbHpXNXcwajBWbnNXCldqaktza2RYM2NwTVRhY3JNbzFoRFdrWlJyNXlTYlZ2aFlhODRTbTg5dlJzWjhJVlQ1QmdaekJxenpqZ0J2eGQKcXMxeXB6MFRjVjRhNGxPLzY2WXhGbHBWYkVzVm9LSmsyeGhvWGdseExSUDlkbktoY1hjMjlxdTNEc2FjSXE1eQpTNEFBbWlXRTVOQmJDRmtPbEIwVmhuNlFtbDQveUxHL3lRRmgrWUtqRU0yUVhrTS9TdnVBM01IdmFPSlR0ZWRiCjJvNmg5Mi9UcWQ1ZHR0YWNWSUg2ZS8vR2NLZTliM1lpdHpLZ25CbG5Id2s5ajI5ZE5BK21Eak9zV2JSQ0lXT0YKZmljPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_complete-example-prod
            
            contexts:
            - context:
                cluster: eks_complete-example-prod
                user: eks_complete-example-prod
              name: eks_complete-example-prod
            
            current-context: eks_complete-example-prod
            
            users:
            - name: eks_complete-example-prod
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "complete-example-prod"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_complete-example-prod"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #24](https://github.com/pipetail/terraform/actions/runs/3552793563)